Tekla Open API Reference for Tekla Structures 2025
Load.LoadAttachmentEnum Enumeration
 The load attachment.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LoadAttachmentEnum
Public Enumeration LoadAttachmentEnum
Members
Member name | Value | Description
LOAD_ATTACHMENT_ATTACH_TO_MEMBER | 4001 |  Attach to member.
LOAD_ATTACHMENT_DONT_ATTACH | 4003 |  Don't attach.
See Also
Reference
Tekla.Structures.Model Namespace